Revit 2024 API
ParameterTypeId.MovesWithGridParam Property
 "Moves With Grids": Disable attachment from grids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId MovesWithGridParam { get; }
Visual Basic
Public Shared ReadOnly Property MovesWithGridParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MovesWithGridParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace